trade_exp/src/DataProcessors/КлиентБанк/КлиентБанк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КлиентБанк</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ОтчетОВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="844403ae-13ef-4788-a892-258713ee38c4">
    <name>ОтчетОЗагрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9be003a7-74c5-4325-b7f3-895f6501902b">
    <name>ПроводитьДокументы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a24a929a-d5f9-498e-ba12-274230163768">
    <name>СоздаватьКонтрагентов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Эквайер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЭквайера</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорЭквайринга</name>
    <type>
      <types>CatalogRef.ДоговорыЭквайринга</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="33b28cec-f67c-4b61-9b0b-fa4771747e08">
    <name>РежимЗаполненияКонтрагентаПоQRПлатежу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>БанковскиеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Ссылка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаПоследнейВыгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НастройкаОбмена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КВыгрузке</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Пометка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЕстьВозможностьПрямогоОбмена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dcefc53b-6b8d-41cf-bac9-432c76e90c0f">
      <name>ПоследняяВыписка</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>30</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыКВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>БанковскийСчет</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Дата</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаВыгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Операция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОписаниеОшибок</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Организация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Выгружать</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерВходящегоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="8c0ff1ac-e94a-4cfe-a37b-672925c1bcdc">
    <name>Файлы</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="7366c22f-5098-4e87-97eb-dbad1129afd3">
    <name>ДокументыКЗагрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:DataProcessor>

trade_exp/src/Enums/СтатусыДоговоровКонтрагентов/СтатусыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыДоговоровКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Действует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3915309e-1c9c-447e-82d1-cd037c7784b2">
    <name>НеСогласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="26b5dc0e-bfd2-43c0-b272-c13aae125257">
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ПоступлениеБезналичныхДенежныхСредств/ПоступлениеБезналичныхДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПоступлениеБезналичныхДенежныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>СтатьяАктивовПассивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПроведенияБанком</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроведеноБанком</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КурсКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>БанковскийСчетОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипПлатежногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПодтверждениеЗачисленияЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИдентификаторПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВалютаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ca94bf97-ddaf-4726-8795-eeed1a424ed7">
    <name>ДатаЗагрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="81a7aaa3-d0a8-4633-a214-e676606223bc">
    <name>ИмяКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДоговорЗаймаСотруднику</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ОснованиеПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТипСуммыКредитаДепозита</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Организация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДоговорКредитаДепозита</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/DataProcessors/КлиентБанк/Forms/ЗагрузкаВыписки/Module.bsl
&НаКлиенте
Процедура Док_ПровестиПосле(Команда)
		ОбщегоНазначенияУТКлиент.ПровестиДокументы(Элементы.ЗагруженныеДокументы, Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура Док_ОтменаПроведенияПосле(Команда)
	ОбщегоНазначенияУТКлиент.ОтменаПроведения(Элементы.ЗагруженныеДокументы, Заголовок);
КонецПроцедуры

&НаСервере
Процедура Док_ЗаменитьЭквайераПослеНаСервере()   
	ТаблицаДокументов = ПолучитьТЗИзДинамическогоСписка();
	Для Каждого ТекущийДокумент Из ТаблицаДокументов Цикл 
		Если СтрНайти(ТекущийДокумент.НазначениеПлатежа,"Платеж СБП") > 0 ИЛИ  СтрНайти(ТекущийДокумент.НазначениеПлатежа,"/ F") > 0
			 ИЛИ  СтрНайти(ТекущийДокумент.НазначениеПлатежа,"согл. в СБП") > 0 Тогда 
			 
			ДокументСБП = Документы.ПоступлениеБезналичныхДенежныхСредств.НайтиПоНомеру(ТекущийДокумент.Номер,ТекущийДокумент.Дата);
			Если Не ДокументСБП.Пустая() И Не ДокументСБП.Проведен Тогда 
				ДокументОбъект = ДокументСБП.ПолучитьОбъект(); 
				ДокументОбъект.Контрагент = Объект.Эквайер;
				ДокументОбъект.БанковскийСчетКонтрагента = Объект.СчетЭквайера;
				ДокументОбъект.ДоговорЭквайринга = Объект.ДоговорЭквайринга;
				ДокументОбъект.Записать();
			КонецЕсли;	 
		КонецЕсли;	
	КонецЦикла;	 
	Элементы.ЗагруженныеДокументы.Обновить(); 
	Сообщить("Документы обновлены.");
КонецПроцедуры     

&НаКлиенте
Процедура Док_ЗаменитьЭквайераПосле(Команда)
	Если ЗначениеЗаполнено(Объект.Эквайер) И ЗначениеЗаполнено(Объект.СчетЭквайера)  И ЗначениеЗаполнено(Объект.ДоговорЭквайринга) Тогда
		Док_ЗаменитьЭквайераПослеНаСервере();                                                	
	Иначе 
		Сообщить("Для замены Эквайер, Счет эквайера и Договор эквайринга должны быть заполнены!!!");
	КонецЕсли;	
КонецПроцедуры     

&НаСервере
Функция ПолучитьТЗИзДинамическогоСписка()
 
	Схема = Элементы.ЗагруженныеДокументы.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.ЗагруженныеДокументы.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТЗ = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТЗ); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Возврат ТЗ;
 
КонецФункции

&НаКлиенте
Процедура Док_ДоговорЭквайрингаНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;      
	Если ЗначениеЗаполнено(Объект.Эквайер) Тогда
		ПараметрыОтбора.Вставить("Контрагент", Объект.Эквайер); 
		ПараметрыОтбора.Вставить("Статус", ПредопределенноеЗначение("Перечисление.СтатусыДоговоровКонтрагентов.Действует"));
	КонецЕсли;	
 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);

	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Ложь);

	ОткрытьФорму("Справочник.ДоговорыЭквайринга.ФормаВыбора",ПараметрыФормы,Элементы.ДоговорЭквайринга);
КонецПроцедуры

&НаКлиенте
Процедура Док_ЗагрузитьДокументыПеред(Команда)
	СФП_МаркерыКлиент.МаркерНачало("Загрузка выписки из банка");
КонецПроцедуры
